Tarea 1 CFD/Simulaciones/L_5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (0 0 0) // V0
    (4 0 0) // V1
    (4 3 0) // V2
    (0 3 0) // V3

    (0 0 0.1) // V4
    (4 0 0.1) // V5
    (4 3 0.1) // V6
    (0 3 0.1) // V7

    (4 -2 0) // V8
    (9 -2 0) // V9
    (9 0 0) // V10
    (9 3 0) // V11

    (4 -2 0.1) // V12
    (9 -2 0.1) // V13
    (9 0 0.1) // V14
    (9 3 0.1) // V15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)
    hex (1 10 11 2 5 14 15 6) (50 40 1) simpleGrading (1 1 1) // Cambiar el grading después
    hex (8 9 10 1 12 13 14 5) (50 40 1) simpleGrading (1 1 1) // Cambiar el grading después
);

edges
(
);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0  4  7  3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 11 15 14)
            (9 10 14 13)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (0 1 5 4) 
            (1 8 12 5) 
            (8 9 13 12) 
            (3 7 6 2)
            (2 6 15 11)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  1  2 3)
            ( 1 10 11 2)
            (8 9 10 1)
            (4 5 6 7)
            (5 14 15 6)
            (12 13 14 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
